DataProcessors/Сервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>Сервис</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/КошелькиПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>КошелькиПартии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПродажиВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиВалюты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПокупкиВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ПокупкиВалюты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Операция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Операция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КошелькиПартии</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.Кошельки</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ПокупкиВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыОбщие</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КошелекПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДолгов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПрямой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщиеЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбщиеЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьРасхождениеДолговЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеткаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/Сервис/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиВсеДокументы(Команда)
	
	ОП = Новый ОписаниеОповещения("ПровестиВсеДокументыВопросЗавершение", ЭтаФорма);
	ПоказатьВопрос(ОП, НСтр("ru = 'Проведение всех документов может занять продолжительное время. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьСтатьи(Команда)	
	ПоказатьПредупреждение(новый ОписаниеОповещения("ПредупреждениеВводСтатьиНачЗавершение", ЭтотОбъект),
	НСтр("ru = 'Укажите статью, которую необходимо заменить'"));
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеПратииВалют(Команда)
	УдалитьВсеПратииВалютНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			
			Если ДлительныеОперацииВызовСервера.ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				
				Если ПараметрыОбработчикаОжидания.Свойство("ОписаниеЗавершения") Тогда 
					ВыполнитьОбработкуОповещения(ПараметрыОбработчикаОжидания.ОписаниеЗавершения);
				КонецЕсли;
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПровестиВсеДокументыНаСервере()
	
	ПараметрыЗадания = Новый Структура();
	
	Попытка
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, "ОбщегоНазначения.ПровестиВсеДокументы",
		ПараметрыЗадания, НСтр("ru = 'Проведение всех документов'"));		
	Исключение
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	АдресХранилища = Результат.АдресХранилища;
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПровестиВсеДокументыВопросЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеЗавершения = Новый ОписаниеОповещения("ПослеПроведенияВсехДокументов", ЭтотОбъект);
	
	Результат = ПровестиВсеДокументыНаСервере();
	
	Если Результат.ЗаданиеВыполнено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеЗавершения);
		
		Возврат;
	КонецЕсли;
	
	// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	
	ПараметрыОбработчикаОжидания.ОписаниеЗавершения = ОписаниеЗавершения;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания, Истина, Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроведенияВсехДокументов(Результат, ДопПараметры) Экспорт 	
	
	#Если МобильноеПриложениеКлиент  Тогда 
		
		СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение(ЗвуковоеОповещение.ПоУмолчанию, Истина);
		
	#КонецЕсли
	
	ПоказатьПредупреждение(, НСтр("ru = 'Выполнено успешно'"));	
	Оповестить("ОбновитьОстатки");
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьСтатьиНаСервере(статьяНач, статьяКон, ОтборКошелек, кол)
	запрос = новый запрос("ВЫБРАТЬ
	|	Операция.Ссылка
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Статья = &Статья
	|	И Операция.Кошелек = &Кошелек");
	запрос.УстановитьПараметр("Статья", статьяНач);
	запрос.УстановитьПараметр("Кошелек", ОтборКошелек);
	
	рез = запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл
		о = рез.ссылка.получитьОбъект();
		о.Статья = статьяКон;
		о.записать(РежимЗаписиДокумента.Проведение);
		
		кол = кол + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеВводСтатьиНачЗавершение(ДопПараметры) Экспорт 	
	ПоказатьВводЗначения(новый ОписаниеОповещения("ВводСтатьиНачЗавершение", ЭтотОбъект), Неопределено,
	НСтр("ru = 'Укажите статью, которую необходимо установить'"), тип("СправочникСсылка.Статьи"));
КонецПроцедуры

&НаКлиенте
Процедура ВводСтатьиНачЗавершение(Результат, ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(новый ОписаниеОповещения("ПредупреждениеВводСтатьиКонЗавершение", ЭтотОбъект, новый Структура("СтатьяНач", Результат)),
	НСтр("ru = 'Укажите статью, которую необходимо установить'"));
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеВводСтатьиКонЗавершение(ДопПараметры) Экспорт 	
	ПоказатьВводЗначения(новый ОписаниеОповещения("ВводСтатьиКонЗавершение", ЭтотОбъект, ДопПараметры), Неопределено,
	НСтр("ru = 'Укажите статью, которую необходимо установить'"), тип("СправочникСсылка.Статьи"));
КонецПроцедуры

&НаКлиенте
Процедура ВводСтатьиКонЗавершение(Результат, ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДопПараметры.вставить("СтатьяКон", Результат);
	
	ПоказатьПредупреждение(новый ОписаниеОповещения("ПредупреждениеВводКошелькаЗавершение", ЭтотОбъект, ДопПараметры),
	НСтр("ru = 'Укажите кошелек, с отбором по которому необходимо заменить статьи'"));
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеВводКошелькаЗавершение(ДопПараметры) Экспорт 	
	ПоказатьВводЗначения(новый ОписаниеОповещения("ВводКошелькаЗавершение", ЭтотОбъект, ДопПараметры), Неопределено,
	НСтр("ru = 'Укажите кошелек, с отбором по которому необходимо заменить статьи'"), тип("СправочникСсылка.Кошельки"));
КонецПроцедуры

&НаКлиенте
Процедура ВводКошелькаЗавершение(Результат, ДопПараметры) Экспорт 
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	кол = 0;
	
	ЗаменитьСтатьиНаСервере(ДопПараметры.статьяНач, ДопПараметры.статьяКон, Результат, кол);
	
	Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Статьи заменены в %1 операциях'"), кол));
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсеПратииВалютНаСервере()
	запрос = новый запрос("ВЫБРАТЬ
	|	КошелькиПартии.Регистратор
	|ИЗ
	|	РегистрНакопления.КошелькиПартии КАК КошелькиПартии");
	рез = запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл
		наборЗ = РегистрыНакопления.КошелькиПартии.СоздатьНаборЗаписей();
		наборЗ.отбор.регистратор.установить(рез.регистратор);
		наборЗ.прочитать();
		наборЗ.Очистить();
		наборЗ.Записать();
	КонецЦикла;
	
	запрос = новый запрос("ВЫБРАТЬ
	|	ПродажиВалюты.Регистратор
	|ИЗ
	|	РегистрНакопления.ПродажиВалюты КАК ПродажиВалюты");
	рез = запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл
		наборЗ = РегистрыНакопления.ПродажиВалюты.СоздатьНаборЗаписей();
		наборЗ.отбор.регистратор.установить(рез.регистратор);
		наборЗ.прочитать();
		наборЗ.Очистить();
		наборЗ.Записать();
	КонецЦикла;
	
	запрос = новый запрос("ВЫБРАТЬ
	|	ПокупкиВалюты.Регистратор
	|ИЗ
	|	РегистрНакопления.ПокупкиВалюты КАК ПокупкиВалюты");
	рез = запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл
		наборЗ = РегистрыНакопления.ПокупкиВалюты.СоздатьНаборЗаписей();
		наборЗ.отбор.регистратор.установить(рез.регистратор);
		наборЗ.прочитать();
		наборЗ.Очистить();
		наборЗ.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
